app/views/events/_list_element.html.erb

SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", "1"]]
---
  <p class="event_tail">
    within group <%= link_to event.group.name, group_events_path(event.group) %>