app/views/events/show.html.erb

        <b><%=t :group %></b>
        <%= @event.group %>
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", "1"]]