app/controllers/events_controller.rb

  def index
    @events = Event.where(group_id: params[:group_id]).all
---
SELECT "events".* FROM "events" WHERE "events"."group_id" = 1

  def create
    @event = @group.events.new(params[:event])

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("category_id", "created_at", "date", "description", "group_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)