app/controllers/groups_controller.rb

SELECT "groups".* FROM "groups" WHERE "groups"."public" = 't'
---
  def index
    @groups = Group.where(public: true).all

SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", "1"]]
---
  def confirm_join
    @group = Group.find(params[:id])

SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", "1"]]
---
  def join
    @group = Group.find(params[:id])

SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "memberships" WHERE "memberships"."id" = ?  [["id", 1]]
---
  def leave
    @group = Group.find(params[:id])

    if (@group.can_leave? current_user)
      membership = @group.membership(current_user)
      membership.destroy

INSERT INTO "groups" ("created_at", "description", "name", "public", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Tue, 03 Apr 2012 17:34:09 UTC +00:00], ["description", "ww"], ["name", "Test"], ["public", true], ["updated_at", Tue, 03 Apr 2012 17:34:09 UTC +00:00], ["user_id", 1]]
---
  def create
    @group = Group.new(params[:group])
    @group.user_id = current_user.id

    respond_to do |format|
      if @group.save

SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @group = Group.find(params[:id])