app/controllers/setup_controller.rb

  def prepare
    @app = Application.create_for_user(current_user)
---
INSERT INTO "applications" ("auth_token_id", "build_started_at", "created_at", "name", "setup_path", "status", "updated_at", "version") VALUES (?, ?, ?, ?, ?, ?, ?, ?)